# ==========인풋과 타입==============================
# a = input()

# print(a)
# 1 10
# print(a, type(a))
# 1 10 <class 'str'>
# ===========스플릿 사용 시======================
# a = input().split()
# print(a)
# ['1', '10']
# ============맵 사용 시=====================
# a = map(int,input().split())
# print(a)
# ??
# print(list(a))
# [1, 10]
# ===========맵 사용 안 할 시======================
# a = input().split()

# new_list = []
# for i in a:
#     new_list.append(int(i))
# print(new_list)
# ==========================================
# a = list(map(int, input().split()))
# print(a)
# [3, 23, 85, 34, 17, 74, 25, 52, 65]
# 나머지는 bash: 앞자리: command not found

# max = 0
# for num in a:
#     if num > max:
#         max = num

# print(max)
# 85

# for i in range(9):
#     a = list(map(int, input().split()))
    # print(a)
# 3 23 85 34 17 74 25 52 65
# 10 7 39 42 88 52 14 72 63
# [10, 7, 39, 42, 88, 52, 14, 72, 63]
# 87 42 18 78 53 45 18 84 53
# [87, 42, 18, 78, 53, 45, 18, 84, 53]
# 34 28 64 85 12 16 75 36 55
# [34, 28, 64, 85, 12, 16, 75, 36, 55]
# 21 77 45 35 28 75 90 76 1
# [21, 77, 45, 35, 28, 75, 90, 76, 1]
# 25 87 65 15 28 11 37 28 74
# [25, 87, 65, 15, 28, 11, 37, 28, 74]
# 65 27 75 41 7 89 78 64 39
# [65, 27, 75, 41, 7, 89, 78, 64, 39]
# 47 47 70 45 23 65 3 41 44
# [47, 47, 70, 45, 23, 65, 3, 41, 44]
# 87 13 82 38 31 12 29 29 80
# [87, 13, 82, 38, 31, 12, 29, 29, 80]

# []

# print(a)
# 3 23 85 34 17 74 25 52 65
# 10 7 39 42 88 52 14 72 63
# 87 42 18 78 53 45 18 84 53
# 34 28 64 85 12 16 75 36 55
# 21 77 45 35 28 75 90 76 1
# 25 87 65 15 28 11 37 28 74
# 65 27 75 41 7 89 78 64 39
# 47 47 70 45 23 65 3 41 44
# 87 13 82 38 31 12 29 29 80

# []
    # for num in a:
    #     if num > max:
    #         max = num

# print(max)
# 90
# ===============다시 해보자=====================================

# # input_ = input()
# # print(input_)
# # 1 10

# max_num = 0
# row = 1
# column = 1

# for i in range(1, 10):
#     input_list = list(map(int, input().split()))
# # print(input_list)
# # 3 23 85 34 17 74 25 52 65
# # 10 7 39 42 88 52 14 72 63
# # 87 42 18 78 53 45 18 84 53
# # 34 28 64 85 12 16 75 36 55
# # 21 77 45 35 28 75 90 76 1
# # 25 87 65 15 28 11 37 28 74
# # 65 27 75 41 7 89 78 64 39
# # 47 47 70 45 23 65 3 41 44
# # 87 13 82 38 31 12 29 29 80

# # []
#     for j, num in enumerate(input_list, 1):
#         if num > max_num:
#             max_num = num
#             row = i
#             column = j
# print(max_num)
# # 90
# # print(i, j)
# # 9 9
# print(row, column)
# # 5 7
# =======다시 해보자============================================

max_num = 0
row = 1
column = 1

for i in range(1, 10):
    input_list = list(map(int, input().split()))

    for j, num in enumerate(input_list, 1):
        if num > max_num:
            max_num = num
            row = i
            column = j

print(max_num)
# 90
print(row, column)
# 5 7